# StirrupTieBendDiameter Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarBarType..::..StirrupTieBendDiameter Property
RebarBarType Class See Also
---
Defines bar and hook bend diameter for rebar whose style is stirrup/tie
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public double StirrupTieBendDiameter { get; set; }
```

Visual Basic
---
```text
Public Property StirrupTieBendDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double StirrupTieBendDiameter {
	double get ();
	void set (double value);
}
```

# ### Field Value
The bar and hook bend diameter for rebar whose style is stirrup/tie
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: the bend diameter stirrupTieBendDiam isn't between bar diameter and 99.0 |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace